run/testCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
                          
convertToMeters 1;
vertices
(
    (0.   0.0    0.0)   // pt 0 (a1b) 
    (300   0.0      0.0)    // pt 1 (a4b) 
    (0.   10      0.0)    // pt 2 (c1b) 
    (300   10      0.0)    // pt 3 (c4b) 

    (0.   0.0    30)   // pt 4 (a1t) 
    (300   0.0      30)    // pt 5 (a4t) 
    (0.   10      30)    // pt 6 (c1t) 
    (300   10      30)    // pt 7 (c4t) 
);

blocks
(
    // Front block
    hex (0 1 3 2 4 5 7 6)
    ( 300 1 43 )
    simpleGrading
    (
        1
        1
        54.7636992374931
    )
);

edges
(
);

boundary
(
    frontField
    {
        type patch;
        faces
        (
            (2 0 4 6)
        );
    }
    backField
    {
        type patch;
        faces
        (
            (3 1 5 7)
        );
    }
    symPlane
    {
        type empty;
        faces
        (
            (0 1 5 4)
        );
    }
    sideField
    {
        type empty;
        faces
        (
            (3 2 6 7)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (1 3 2 0)
	    );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 7 6)
	    );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
