run/testCase/constant/reactions
species
(
    air
    CH4
);

reactions
{
}
