run/testCase/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
cubeLen 0.1;
cubeHeight 0.125;
cubeWidth 0.15;

sourceRad 0.1;
sourceHeight 0.125;
sourcePos -1;
actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.05 -100 -100) (0.05 0.075 0.125);
        }
    }
    {
        name    c0;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1     ($sourcePos 0 0);
            p2     ($sourcePos 0 $sourceHeight);
            radius  $sourceRad;
        }
    }

    {
        name    c0;
        type    cellSet;
        action  invert;
    }
    
);

// ************************************************************************* //
